Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server
Identifier: com.github.djdelisser.jamf-recipes.jamf.GitHubDesktop-m1-pkg-upload
MinimumVersion: "2.3"
ParentRecipe: com.github.djdelisser.jamf-recipes.pkg.GitHubDesktop-m1

Input:
  CATEGORY: Dev & Engineering

Process:   
    - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
      Arguments:
        category_name: "%CATEGORY%"