Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server
Identifier: com.github.djdelisser.jamf-recipes.jamf.Outlook-pkg-upload
MinimumVersion: "2.3"
ParentRecipe: com.github.djdelisser.jamf-recipes.pkg.Outlook

Input:
  CATEGORY: Microsoft Office

Process:   
    - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
      Arguments:
        category_name: "%CATEGORY%"