Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server
Identifier: com.github.djdelisser.jamf-recipes.jamf.AdobeCreativeCloud-Intel-pkg-upload
MinimumVersion: "2.3"
ParentRecipe: com.github.djdelisser.jamf-recipes.pkg.AdobeCreativeCloud-Intel

Input:
  CATEGORY: Adobe

Process:   
    - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    
    - Processor: com.github.grahampugh.jamf-upload.processors/JamfUploaderSlacker

    - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
      Arguments: 
        category_name: "%CATEGORY%"