Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server
Identifier: com.github.djdelisser.jamf-recipes.jamf.zoom-pkg-upload
MinimumVersion: "2.3"
ParentRecipe: com.github.djdelisser.jamf-recipes.download.zoom

Input:
  CATEGORY: Collaboration

Process:   
    - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    
    - Processor: com.github.grahampugh.jamf-upload.processors/JamfUploaderSlacker