Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server
Identifier: com.github.djdelisser.jamf-recipes.jamf.Spotify-pkg-upload
MinimumVersion: "2.3"
ParentRecipe: com.github.djdelisser.jamf-recipes.pkg.Spotify

Input:
  CATEGORY: Digital Media


Process:   
    - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

    - Processor: com.github.grahampugh.jamf-upload.processors/JamfUploaderSlacker

    - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
      Arguments: 
        category_name: "%CATEGORY%"