<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Google Drive.</string>
	<key>Identifier</key>
	<string>com.github.djdelisser.jamf-recipes.download.GoogleDrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleDrive</string>
        <key>DOWNLOAD_URL</key>
        <string>https://dl.google.com/drive-file-stream/GoogleDrive.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/GoogleDrive.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Google LLC (EQHXZ8M8AV)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>