<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Creative Cloud Installer.</string>
	<key>Identifier</key>
	<string>com.github.djdelisser.jamf-recipes.download.AdobeCC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Creative Cloud Installer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://prod-rel-ffc-ccm.oobesaas.adobe.com/adobe-ffc-external/core/v1/wam/download?sapCode=KCCC&amp;productName=Creative%20Cloud&amp;os=mac&amp;guid=e134c519-0470-4fba-ac32-1e3e495d1f17&amp;contextParams=%7B%22component%22%3A%22cc-home%22%2C%22visitor_guid%22%3A%2254280792535147618833821712368541951662%22%2C%22browser%22%3A%22chrome%22%2C%22context_guid%22%3A%22ea4d24e3-8d24-43a7-beb1-9095c02c84ad%22%2C%22planCodeList%22%3A%22%22%2C%22updateCCD%22%3A%22true%22%2C%22secondarySapcodeList%22%3A%22%22%2C%22Product_ID_Promoted%22%3A%22KCCC%22%2C%22contextComName%22%3A%22ACom%3ACCH%22%2C%22contextSvcName%22%3A%22NO-CCD%22%2C%22contextOrigin%22%3A%22ACom%3ACCH%22%2C%22aam_uuid%22%3A%2254123419301544105173837517937888760352%22%2C%22gpv%22%3A%22adobe.com%3Acreativecloud%3Adesktop-app%22%2C%22creative-cloud-referrer%22%3A%22https%3A%2F%2Fwww.adobe.com%2F%22%2C%22AMCV_9E1005A551ED61CA0A490D45%2540AdobeOrg%22%3A%22870038026%257CMCMID%257C54280792535147618833821712368541951662%257CMCAAMLH-1636375423%257C7%257CMCAAMB-1636375423%257CRKhpRz8krg2tLO6pguXWp5olkAcUniQYPHaMWWgdJ3xzPWQmdj0y%257CMCOPTOUT-1635777823s%257CNONE%257CMCAID%257CNONE%257CMCCIDH%257C707292771%257CvVersion%257C5.0.0%257CMCIDTS%257C18933%22%2C%22mid%22%3A%2254280792535147618833821712368541951662%22%2C%22aid%22%3A%22%22%2C%22AppMeasurementVersion%22%3A%222.20.0%22%2C%22kaizenTrialDuration%22%3A7%7D&amp;wamFeature=nuj-live&amp;environment=prod&amp;api_key=CCHomeWeb1</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Creative Cloud Installer.app</string>
				<key>requirement</key>
				<string>anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Creative Cloud Installer.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
